yunjiuxuan/stm32-/day9/A_BLE_bt_wifi_key_hc04_temp_pwm_8_14_am/Dsp/oled.h
//              GND   ��Դ��
//              VCC   ��5V��3.3v��Դ
//              SCL   ��PB8��SCL��
//              SDA   ��PB9��SDA��            

#ifndef __OLED_H
#define __OLED_H			  	 
#include "sys.h"
#include "stdlib.h"	    	
#include "stm32f4xx.h"
#define OLED_MODE 0
#define SIZE 8
#define XLevelL		0x00
#define XLevelH		0x10
#define Max_Column	128
#define Max_Row		64
#define	Brightness	0xFF 
#define X_WIDTH 	128
#define Y_WIDTH 	64	    


//-----------------OLED IIC interface definition----------------
// SCL = PB15, SDA = PD10

#define OLED_SCLK_Clr() GPIO_ResetBits(GPIOB,GPIO_Pin_15)//SCL IIC clock signal
#define OLED_SCLK_Set() GPIO_SetBits(GPIOB,GPIO_Pin_15)

#define OLED_SDIN_Clr() GPIO_ResetBits(GPIOD,GPIO_Pin_10)//SDA IIC data signal
#define OLED_SDIN_Set() GPIO_SetBits(GPIOD,GPIO_Pin_10)

 		     
#define OLED_CMD  0	//д����
#define OLED_DATA 1	//д����


//OLED�����ú���
void OLED_WR_Byte(unsigned dat,unsigned cmd);  
void OLED_Display_On(void);
void OLED_Display_Off(void);	   							   		    
void OLED_Init(void);
int8_t oled_setmode(GPIOMode_TypeDef GPIO_Mode);
void OLED_Clear(void);
void OLED_DrawPoint(u8 x,u8 y,u8 t);
void OLED_Fill(u8 x1,u8 y1,u8 x2,u8 y2,u8 dot);
void OLED_ShowChar(u8 x,u8 y,u8 chr,u8 Char_Size);
void OLED_ShowNum(u8 x,u8 y,u32 num,u8 len,u8 size);
void OLED_ShowString(u8 x,u8 y, u8 *p,u8 Char_Size);	 
void OLED_ShowFloat(u8 x, u8 y, float num, u8 int_len, u8 frac_len, u8 size2);
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(u8 x,u8 y,u8 no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
void fill_picture(unsigned char fill_Data);
void Picture();
void Write_IIC_Command(unsigned char IIC_Command);
void Write_IIC_Data(unsigned char IIC_Data);

#endif  
	 



